//
//  NSString+CustomString.m
//  CZAstanaObjC
//
//  Created by Admin on 12/23/16.
//  Copyright © 2016 AAkash. All rights reserved.
//

#import "NSString+CustomString.h"

@implementation NSString (CustomString)

+(NSString*)categoryNameKaz {
    return @"categoryNameKaz";
}
+(NSString*)nameKaz {
    return @"nameKaz";
}
+(NSString*)requirementsKaz {
    return @"requirementsKaz";
}
+(NSString*)categoryNameRus {
    return @"categoryNameRus";
}
+(NSString*)nameRus {
    return @"nameRus";
}
+(NSString*)requirementsRus {
    return @"requirementsRus";
}
+(NSString*)vacancyKaz {
    return @"Бос орындар";
}
+(NSString*)profTest {
    return @"Проф-тест";
}
+(NSString*)eventsKaz {
    return @"Шаралар";
}
+(NSString*)contactsKaz {
    return @"Байланыстар";
}
+(NSString*)applicantKaz {
    return @"Жұмыс іздеушілерге";
}
+(NSString*)employeeKaz {
    return @"Жұмыс берушілерге";
}
+(NSString*)aboutKaz {
    return @"Жоба жайлы";
}
+(NSString*)settingsKaz {
    return @"Баптаулар";
}
+(NSString*)vacancyRus {
    return @"Вакансии";
}
+(NSString*)eventsRus {
    return @"Мероприятия";
}
+(NSString*)contactsRus {
    return @"Контакты";
}
+(NSString*)applicantRus {
    return @"Соискателям";
}
+(NSString*)employeeRus {
    return @"Работодателям";
}
+(NSString*)aboutRus {
    return @"О проекте";
}
+(NSString*)settingsRus {
    return @"Настройки";
}
+(NSString*)enterKaz {
    return @"КІРУ";
}
+(NSString*)enterRus {
    return @"ВОЙТИ";
}
+(NSString*)settingCell {
    return @"SettingsCell";
}
+(NSString*)eventCell {
    return @"EventCell";
}
+(NSString*)languageKazakh {
    return @"Қазақша";
}
+(NSString*)languageRussian {
    return @"Русский";
}
+(NSString*)vacancyViewController {
    return @"VacancyVC";
}
+(NSString*)categoryAllKaz {
    return @"Барлығы";
}
+(NSString*)categoryAllRus {
    return @"Все";
}
+(NSString*)submitButtonKaz {
    return @"Жасыру";
}
+(NSString*)submitButtonRus {
    return @"Скрыть";
}
+(NSString*)topicCell {
    return @"TopicCell";
}
+(NSString*)jobCell {
    return @"JobCell";
}
+(NSString*)descriptionKaz {
    return @"descriptionKaz";
}
+(NSString*)descriptionRus {
    return @"descriptionRus";
}
+(NSString*)interviewChooseLabelKaz {
    return @"Сұхбаттасу";
}
+(NSString*)resumeChooseLabelKaz {
    return @"Түйіндеме";
}
+(NSString*)interviewChooseLabelRus {
    return @"Собеседование";
}
+(NSString*)resumeChooseLabelRus {
    return @"Резюме";
}
+(NSString*)rightChooseLabelKaz {
    return @"Құқығы";
}
+(NSString*)rightChooseLabelRus {
    return @"Права";
}
+(NSString*)dutyChooseLabelKaz {
    return @"Міндеттері";
}
+(NSString*)dutyChooseLabelRus {
    return @"Обязанности";
}
+(NSString*)employersObligationStringRus {
    return  @"Обязанности работодателя\n\nИзвлечение Закона О занятости населения РК от 6 апреля 2016 года работодатель обязан:\n\n1) направлять центру занятости населения сведения о наличии свободных рабочих мест (вакантных должностей) в течение трех рабочих дней со дня их появления с указанием условий труда и оплаты;\n\n2) предоставлять центру занятости населения в полном объеме информацию о предстоящем высвобождении работников в связи с ликвидацией работодателя – юридического лица либо прекращением деятельности работодателя – физического лица, сокращением численности или штата, снижением объема производств и выполняемых работ и услуг, повлекшего ухудшение экономического состояния работодателя, о количестве и категориях работников, которых оно может коснуться, с указанием должностей и профессий, специальностей, квалификации и размера оплаты труда высвобождаемых работников и сроков, в течение которых они будут высвобождаться, не менее чем за один месяц до начала высвобождения;\n\n3) возмещать расходы центра занятости населения на оплату профессионального обучения, выплату стипендии и материальной помощи участнику активных мер содействия занятости в случае отказа в приеме его на работу после профессионального обучения на основании социального контракта, заключенного с участием работодателя, за исключением случаев отказа при ликвидации работодателя – юридического лица либо прекращении деятельности работодателя – физического лица, сокращении численности или штата работников, снижении объема производств и выполняемых работ и услуг, повлекшем ухудшение экономического состояния работодателя;\n\n4) своевременно (в течение пяти рабочих дней со дня направления для трудоустройства) извещать центр занятости населения о приеме на работу или об отказе в приеме на работу путем соответствующей отметки в направлении (с указанием причины в случае отказа в приеме на работу);\n\n5) предоставлять уполномоченному органу по вопросам занятости населения сведения о количестве прошедших профессиональную подготовку, переподготовку и внутрипроизводственное обучение с указанием полученной специальности и квалификации;\n\n6) выполнять квоту для трудоустройства инвалидов в размере от 2 до 4 % от численности рабочих мест без учета рабочих мест на тяжелых работах, работах с вредными, опасными условиями труда в порядке, определяемом уполномоченным органом по вопросам занятости населения, лиц, состоящих на учете службы пробации; лиц, освобожденных из мест лишения свободы, граждан из числа молодежи, потерявших или оставшихся до наступления совершеннолетия без попечения родителей, являющихся выпускниками организаций образования), за исключением случаев ликвидации работодателя – юридического лица либо прекращения деятельности работодателя – физического лица, сокращения численности или штата работников, снижения объема производств, выполняемых работ и оказываемых услуг, повлекшего ухудшение экономического состояния работодателя.\n\n7) не допускать в информации о вакансиях для приема на работу требования дискриминационного характера в сфере труда.\n\n8) обеспечить выезд привлекаемого иностранного работника за пределы Республики Казахстан в связи с прекращением действия разрешения на привлечение иностранной рабочей силы.\n\n9) производить социальные отчисления в соответствии с законодательством Республики Казахстан об обязательном социальном страховании.\n\n10) предоставлять информацию в уполномоченный орган по вопросам занятости населения о приеме на работу иностранцев или лиц без гражданства, привлекаемых на основании справки о соответствии квалификации для самостоятельного трудоустройства, и (или) прекращении трудовых отношений с ними.\n\n";
}
+(NSString*)employersRightsStringRus {
    return @"Права работодателя\n\nСогласно статье 28 пункта 3 Закона О занятости населения РК от 6 апреля 2016 года работодатель имеет право:\n\n1) принимать на работу лиц, непосредственно обратившихся к нему, на равных условиях с лицами, имеющими направления центров занятости населения;\n\n2) получать от центров занятости населения бесплатную информацию о состоянии рынка труда;\n\n3) получать от центра занятости населения услуги по отбору и направлению на трудоустройство лиц, ищущих работу;\n\n4) принимать участие в организации общественных работ и социальных рабочих мест, организовывать и проводить другие виды работ временного характера;\n\nПримечание РЦПИ!\n\nПодпункт 5) пункта 1 вводится в действие с 01.01.2018.\n\n5) получать субсидию на создание специальных рабочих мест для трудоустройства инвалидов;\n\n6) участвовать в организации прогнозирования и определении потребности в кадрах по отраслям экономики.";
}
+(NSString*)employersObligationStringKaz {
    return @"Жұмыс берушінің міндеті\n\n2016 жылғы 6 сәуірдегі Халықты жұмыспен қамту туралы Қазақстан Республикасының Заңынаң алынған:\n\n1) бос жұмыс орындарының (бос лауазымдардың) болуы туралы мәліметтерді еңбек жағдайлары мен төлемақысын көрсете отырып, пайда болған күнінен бастап үш жұмыс күнi iшiнде халықты жұмыспен қамту орталығына жiберуге;\n\n2) жұмыс беруші — заңды тұлғаның таратылуына не жұмыс беруші — жеке тұлға қызметінің тоқтатылуына, адам санының немесе штаттың қысқартылуына байланысты, жұмыс берушінің экономикалық жағдайының нашарлауына әкелетін өндірістердің және орындалатын жұмыстар мен көрсетілетін қызметтер көлемінің төмендеуі кезінде алдағы уақытта жұмыскерлердiң жұмыстан босайтыны туралы, босатылатын жұмыскерлердiң лауазымдары мен кәсіптері, мамандықтары, бiлiктiлiгi және еңбекақы мөлшерi көрсетiле отырып, жұмыстан босатылуы мүмкiн жұмыскерлердiң саны мен санаттары туралы және олар жұмыстан босатылатын мерзiмдер туралы жұмыстан босату басталардан кемінде бір ай бұрын халықты жұмыспен қамту орталығына толық көлемде ақпарат беруге;\n\n3) жұмыс беруші – заңды тұлғаның таратылуы не жұмыс беруші – жеке тұлға қызметінің тоқтатылуы, адам санының немесе жұмыскерлер штатының қысқартылуы, жұмыс берушінің экономикалық жағдайының нашарлауына әкелетін өндірістердің және орындалатын жұмыстар мен көрсетілетін қызметтер көлемінің төмендеуі кезіндегі бас тартқан жағдайларды қоспағанда, жұмыс берушінің қатысуымен жасалған әлеуметтік келісімшарт негізінде кәсіптік оқытудан кейін оны жұмысқа қабылдаудан бас тартқан жағдайда, халықты жұмыспен қамту орталығының кәсіптік оқытуға төлеуге, жұмыспен қамтуға жәрдемдесудің белсенді шараларының қатысушыларына стипендиялар төлеуге және материалдық көмекке арналған шығыстарын өтеуге;\n\n4) жолдамаға тиiстi белгi қою арқылы себебiн көрсете отырып, жұмысқа қабылдау немесе жұмысқа қабылдаудан бас тарту туралы дер кезiнде (жұмысқа орналастыру үшін жiберген күннен бастап бес жұмыс күнi iшiнде) халықты жұмыспен қамту орталығына хабарлауға;\n\n5) алған мамандығы мен біліктілігін көрсете отырып, кәсіптік даярлаудан, қайта даярлаудан және өндiрiсішілiк оқытудан өткендердің саны туралы мәліметтерді халықты жұмыспен қамту мәселелері жөніндегі уәкілетті органға ұсынуға;\n\n6) жұмыс беруші — заңды тұлғаның таратылуы не жұмыс беруші — жеке тұлға қызметінің тоқтатылуы, адам санының немесе жұмыскерлер штатының қысқартылуы, жұмыс берушінің экономикалық жағдайының нашарлауына әкелетін өндірістердің және орындалатын жұмыстар мен көрсетілетін қызметтер көлемінің төмендеуі жағдайларын қоспағанда, белгiленген квотаны орындауға тиісті. Ауыр жұмыстарды, еңбек жағдайлары зиянды, қауіпті жұмыстардағы жұмыс орындарын есептемегенде, халықты жұмыспен қамту мәселелері жөніндегі уәкілетті орган айқындайтын тәртіппен жұмыс орындары санының 2 ден 4% дейінгі мөлшерiнде мүгедектерді жұмысқа алуы тиіс, пробация қызметінің есебінде тұрған адамдарды жұмысқа алауы тиіс, бас бостандығынан айыру орындарынан босатылған адамдарды жұмысқа алуы тиіс, кәмелеттік жасқа толғанға дейін ата-анасынан айырылған немесе ата-аналарының қамқорлығынсыз қалған жастар қатарындағы білім беру ұйымдарының түлектері болып табылатын азаматтарды жұмысқа орналастыру үшін квоталар белгіленген. Мүгедектердің қоғамдық бірлестіктеріне, сондай-ақ, жұмыскерлердің орташа жылдық санының 20% астамын мүгедектер құрайтын ұйымдарға квота белгіленбейді.\n\n7) жұмысқа қабылдау үшін бос жұмыс орындары туралы ақпаратта еңбек саласындағы кемсітушілік сипаттағы талаптарға жол бермеуге.\n\n8) шетелдік жұмыс күшін тартуға рұқсат қолданысының тоқтатылуына байланысты, тартылған шетелдік жұмыскердің Қазақстан Республикасынан тыс жерлерге шығуын қамтамасыз етуге.\n\n9) Қазақстан Республикасының міндетті әлеуметтік сақтандыру туралы заңнамасына сәйкес әлеуметтік аударымдар жүргізуге.\n\n10) өз бетінше жұмысқа орналасу үшін біліктілігінің сәйкестігі туралы анықтама негізінде жұмысқа тартылған шетелдiк немесе азаматтығы жоқ адамдарды жұмысқа қабылдағаны туралы және (немесе) олармен еңбек қатынастарын тоқтатқаны туралы ақпаратты халықты жұмыспен қамту мәселелері жөніндегі уәкілетті органға ұсынуға міндетті.\n\n";
}

+(NSString*)employersRightsStringKaz {
    return @"Жұмыс берушінің құқығы 2016 жылғы 6 сәуірдегі Халықты жұмыспен қамту туралы Қазақстан Республикасының Заңындағы 28-бабының 3 тармағына сәйкес\n\n1) Жұмыс берушінің оған тікелей өтініш білдірген адамдарды халықты жұмыспен қамту орталықтарының жолдамасы бар адамдармен бірдей шарттарда жұмысқа қабылдауға;\n\n2) халықты жұмыспен қамту орталықтарынан еңбек нарығының жай-күйі туралы тегін ақпарат алуға;\n\n3) халықты жұмыспен қамту орталығынан жұмыс іздеп жүрген адамдарды жұмысқа орналастыруға іріктеу және жіберу бойынша көрсетілетін қызметтерді алуға;\n\n4) қоғамдық жұмыстарды және әлеуметтік жұмыс орындарын ұйымдастыруға қатысуға, уақытша сипаттағы жұмыстардың басқа да түрлерін ұйымдастыруға және жүргізуге;\n\nРҚАО-ның ескертпесі!\n\n5) тармақша 01.01.2018 бастап қолданысқа енгізіледі - ҚР 06.04.2016 № 482-V Заңымен.\n\n5) мүгедектерді жұмысқа орналастыру үшін арнайы жұмыс орындарын құруға субсидия алуға;\n\n6) экономиканың салалары бойынша кадрларға қажеттілікті болжауды ұйымдастыруға және айқындауға қатысуға құқығы бар.";
}

+(NSString*)applicantsInterviewStringKaz {
    return @"KazAPP";
}

+(NSString*)applicantsResumeStringKaz {
    return @"RseumseKaz";
}

+(NSString*)applicantsInterviewStringRus {
    return  @"Вопросы на собеседовании: Претендуете ли вы на другие вакансии?\n\nОх уж эти ловкие HR-специалисты! Знают как выудить нужную информацию о Вас. А Вы, к сожалению, часто теряетесь в догадках, чего они хотят услышать. На самом деле кадровики хотят и узнать о серьезности Ваших намерений, и, заодно, оценить уровень конкуренции в отрасли, то есть собственные шансы заполучить лучшего сотрудника в компанию. Каков же самый ожидаемый ответ на этот вопрос? Во-первых, говорить «нет» точно не стоит. Очень редко человек претендует только на одну вакансию, поэтому на собеседовании могут подумать, что Вы лжете. Или неинтересны другим компаниям. Честно и подробно рассказывать кто уже готов взять Вас на работу тоже не стоит. Работодатель подумает, что уже упустил свой шанс нанять Вас, а значит, Вы не стоите его времени и сил. Говорить негативно о других собеседованиях также не лучший вариант. Так что при ответе на вопрос о других предложениях придется балансировать на грани. При этом нужно быть на высоте! «Я прохожу собеседования в нескольких организациях, но на данный момент не могу определиться какое из предложений мне наиболее интересно.» Весьма нейтральная фраза, правда? Но в своем ответе желательно еще и подчеркнут преимущества компании, в которой Вы находитесь в данный момент. Если у Вас действительно есть предложения от нескольких компаний той же отрасли, это, пожалуй, самая выгодная позиция. Расскажите, что сейчас ведете переговоры сразу с несколькими работодателями, но более всего заинтересованы в трудоустройстве именно в ту компанию, с представителем которой разговариваете сейчас. Даже если в действительности это не так. Можно даже назвать конкурентов. «Именно Вы предоставляете мне те условия и возможности, на которые я рассчитываю», - эта фраза понравится любому работодателю. Случай, если Вас хотят одновременно нанять компании, представляющие несколько отраслей, уже не так однозначен. Если Вы признаетесь честно, HR-специалист может сделать вывод, что Вы запутались и не знаете чем хотите заниматься. Найдите общее между всеми вакансиями, на которые претендуете и попробуйте рассказать об этом: «прохожу собеседования на позиции, связанные с обслуживанием клиентов» или «с увеличением продаж», или «с консультированием». Главное, чтобы это звучало убедительно. Если Вами в данный момент не интересуется больше ни одна компания, отвечать честно все же не стоит. Врать тоже не получится: часто представители одной отрасли общаются между собой и знают, требуются ли сейчас сотрудники конкурентам. Наилучший вариант – постараться уйти от прямого ответа. Поговорить о компаниях, которым Вы отправили свое резюме. Описать предполагаемую должность. Сообщить, что Вы пока еще на начальном этапе поиска подходящей работы. Главное – дайте понять собеседнику, что это предложение для Вас много значит, и что Вы востребованы на рынке труда. И тогда шанс, что ваши интересы совпадут, увеличится.\n\n2 Вопросы на собеседовании: Почему вы уверены, что подходите для этой должности?\n\nКаждое собеседование о приеме на работу - своего рода диалог продавца и покупателя. Здесь покупателем является работодатель и именно он может задать вопрос \"Почему Вы уверены, что подходите для этой должности?\". На самом деле, этот вопрос совсем не страшен, и даже сыграет Вам на руку, если ответить на него грамотно. Плохим ответом было бы начать говорить о себе: \"Мне очень нужна эта работа\", \"Я бы очень хотел получить эту работу\", \"я бы отлично справился\". Хороший ответ базируется на том, какие проблемы вы можете решить для этой компании, какие идеи и решения вы можете привнести. Вспомните, какие качества компания ищет в соискателях (это должно быть написано в описании вакансии), и привяжите свой ответ к ним. Опишите какимы необходимыми для этой работы навыками и качествами Вы владеете. Если работа напряженная - расскажите о том, как Вы стрессоустоичивы и упорны. Если дожлность нацелена на работу с людьми - расскажите, как вы комуникабельны. Если на этой работе нужно быстро учиться - расскажите о своих способностях к этому. Приводите примеры из собственного опыта, которые покажут, что Вы уже сталкивались с подобным. Покажите работодателям, что именно вы подходите для этой должности. Вы должны знать как ваши навыки подходят для этой работы и показать это собеседнику. Вот пример того, как следовало бы ответить: \"Я идеально подхожу для этой должности, потому что вы сказали, что ищете такие качества как А,Б и В. Я обладаю А, - мы об этом говорили, у меня есть Б, и это я Вам показал, и В у меня есть - вы задавали мне об этом вопросы. Я отвечаю всем вашим требованиям и именно поэтому я - идеальный кандидат\". Этим ответом подведите итог вашего собеседования. Отбросьте застенчивость и расскажите работодателю, что именно такой работник как вы им очень нужен. Вот пример того, как следовало бы ответить: \"Я идеально подхожу для этой должности, потому что вы сказали, что ищете такие качества как А,Б и В. Я обладаю А, - мы об этом говорили, у меня есть Б, и это я Вам показал, и В у меня есть - вы задавали мне об этом вопросы. Я отвечаю всем вашим требованиям и именно поэтому я - идеальный кандидат\". Этим ответом подведите итог вашего собеседования. Отбросьте застенчивость и расскажите работодателю, что именно такой работник как вы им очень нужен.\n\n3 Вопросы на собеседовании: Каким одним словом Вы бы себя описали?\n\nСамое главное в собеседовании это то, как Вы к нему подготовитесь. Ответы на все вопросы, которые может задать Вам интервьюер должны быть готовы у Вас в голове. Это касается и такого непростого вопроса как:\"Каким одним словом Вы бы себя описали?\". Он многим похож на вопрос: \"Расскажите о себе\", но ещё более каверзный, ведь ответить нужно всего одним словом из-за которого Вас захотят принять на работу. Слово, которым Вы опишите себя должно иметь непосредственное отношение к работе, так что воздержитесь от прилагательных не имеющих отношения к трудовым характеристикам. Вам нужно слово, не просто описывающее Вас как личность, но указывающее на те качества, которые требуются от кандидата на эту должность. Ответственный, мотивированный - вот хорошие слова. Также как: стратегический, гибкий, творческий, надёжный, полезный, справедливый, честный, сосредоточенный, устойчивый, организованный, энтузиаст, или возможно даже ценный. Если Вам тяжело оценивать себя - попросите о помощи своих близких. Спросите каким словом они бы описали Вас. В худшем случае они помогут найти верное направление для размышлений. И последнее: будьте готовы объяснить почему именно этим словом Вы бы себя описали. Расскажите историю из Вашего рабочего опыта, которая бы объяснила Ваш выбор.\n\n4 Вопросы на собеседовании: “Расскажите о себе”\n\nНекоторые люди думают, что это вопрос задают лишь для разрядки обстановки, так как это один из первых вопросов, который задают на собеседовании, а также потому, что в нормальных обстоятельствах, это действительно вопрос для разрядки обстановки и начала разговора. Поэтому люди отвечают на этот вопрос так, как будто они находяться в обычной жизненной ситуации и говорят, что-то подобно образцу: \\“У меня трое детей, я люблю пробегать марафоны, я болею за Кайрат.\" и так далее. Это большая ошибка! Это не правильный ответ, потому как суть вопрос в другом. Когда рекрутер говорит, \\“Расскажите о себе\\” , в действительности он хочет знать \"Скажите мне, почему я должен взять вас на эту должность.” Это золотая возможность для Вас, расположить работодателя к себе и дать понять, что Вы являетесь отличным кандидатом. Это открытый вопрос, и Вы можете говорить все, что считаете нужным. Поэтому, следует подумать о вакансии, требованиях, исследованиях о компании, которое Вы провели до собеседования, и поставить себя на место рекрутера:\"Что может впечатлить его больше всего? Что могло бы привлечь внимание этого человека и заставить его сидеть и внимательно Вас слушать до конца собеседования? Вам нужно начать с Вашего образования - какая у Вас научная степень? Если у Вас высокий средний бал, Вы можете упомянуть об этом - но если у Вас средний или ниже среднего, то лучше не говорить об этом. Достаточно будет сказать о Вашей степени. Если Вы писали курсовую работу, которая отличается от Вашей специальности, но относиться к этой работе, это подходящее время рассказать об этом. Далее перейдите к Вашей квалификации. Отметьте только следующие моменты: продвижение по службе, награды, или ключевые достижения. Не обязательно перечислять все, чем больше всего Вы гордитесь - нужно подмечать те вещи, которые смогут впечатлить этого рекрутера, для этой должности. Это требует стратегических размышлений с Вашей стороны, до того как Вы попадёте на собеседования - думайте об этом, как о составлении Вашего резюме. Вы корректируете Ваше резюме под вакансию, до того, как откликаетесь на нее, верно? И также Вам следует сформулировать Ваш ответ на этот вопрос до того как Вы ответите. Просто подумайте: Какая часть Вашей истории может стать причиной для того, чтоб этот рекрутер нанял Вас? Вот, что значит стратегия во время собеседования. Вам не нужно говорить дольше минуты - просто доставьте Ваше целевое сообщение, которое скажет менеджеру: “У меня большой опыт, я уже достиг конкретных целей, и это поможет мне эффективно работать на этой должности.'\n\n5 Вопросы на собеседовании: Почему вас уволили с предыдущего места работы?\n\nВ современном быстроизменяющемся мире шансы что вас никогда не уволят достаточно малы. Независимо от того, какая была ситуация и что привело к увольнению, вам стоит основательно подготовиться к вопросу потенциального работодателя. Вопрос может быть «Вас когда-либо увольняли?», или «Почему вас уволили с предыдущей работы?» Также достаточно велики шансы того, что человек, который проводит собеседование был по обе стороны баррикад. В большинстве случаев, рекрутер будет искать определенную схему в вашем ответе, схему, которую большинство знают как схему «бутерброд». Эта схема означает чередование позитивных и негативных моментов в вашем ответе. В данном случае лучший вариант – позитивный-негативный-позитивный. Пример: \"На прошлую работу я пришла как веб дизанер. Мне очень нравилась моя работа и нравились проекты над которыми я трудилась. В связи с изменением направления деятельности компании мне пришлось выполнять функции копирайтера. Я неплохо пишу тексты, но я понимаю, что не особо старалась. Когда я это поняла, было достаточно поздно. Именно поэтому я пришла к вам, и меня очень воодушевляет перспектива работать частью вашей команды, быть веб-дизайнером, работать на той должности, на которую я изначально пришла в ту компанию. Если в будущем моя роль будет меняться, я не буду сидеть молча, я первая приду обсудить детали.\" Давайте проанализируем этот ответ. Самое важное, что увидит работодатель это то, что была проблема, вы ее осознали, и приняли меры чтобы больше ее недопускать. Именно для того, чтобы произвести такой эффект мы и рекомендуем записать вашу историю длиной не более 3 минут и хорошо ее отрепетировать.";
}
+(NSString*)applicantsResumeStringRus {
    return @"Как составить правильное резюме?\n\nПервое правило составления резюме – читабельность. Резюме должно быть максимально удобным для чтения и понимания. С этой целью, следует обратить внимание на его структуру и оформление. Сделать это очень просто, соблюдая следующие десять пунктов:\n\nПроследите, чтобы у резюме был заголовок, которым должны являться ваше имя и фамилия.\n\nВыделите заголовки разделов межстрочным пробелом, а также жирным или более крупным шрифтом (образование, опыт работы и т.д.). Если ваша информация будет иметь четко выделенные смысловые блоки, она будет легче восприниматься.\n\nИнформацию внутри подразделов лучше всего представлять в виде списков. Работодателю трудно будет разобраться в вашем опыте, если он свален в одно предложение.\n\nЧтобы ваше резюме легко читалось, следует избегать длинных и трудных для восприятия речевых оборотов. Непонятный, трудный для чтения текст никто по несколько раз перечитывать не будет. Если какое-то предложение в резюме превышает 3 строки – подумайте над тем, как его можно разделить на два или сократить.\n\nПри описании своих достижений используйте глаголы прошедшего времени и совершенного вида, например: увеличил, внедрил, разработал, сократил, вместо слов, ориентированных на процесс: внедрял, разрабатывал и т.п.\n\nПроследите, чтобы ваше резюме было оформлено в одном стиле. К примеру, используйте один и тот же шрифт для всего текста резюме.\n\nНе используйте декоративные шрифты. Рекомендуемыми шрифтами являются Times New Roman или Arial размером – 12  (допускается размер от 10 до 14 в зависимости от возможности разместить весь текст на одной странице).\n\nДля лучшего восприятия текста, рекомендуется использовать одинарный межстрочный интервал.\n\nФотография. С точки зрения получения результата фотография в резюме может как помочь, так и навредить. Риск заключается в том, что резюме с фотографией может создать у рекрутера предвзятое впечатление, мешающее правильно оценить возможности соискателя. По этому, фото лучше предоставлять тогда, когда вы уверены, что ваша фотография произведет положительное впечатление или когда это специально оговорено в объявлении о вакансии.\n\nНе используйте аббревиатуры, значения которых работодателю могут быть неизвестны. Лучше указать полные названия учебных заведений и подразделений, в которых вы учились и работали.\n\nВторое правило написания резюме – краткость и лаконичность. Те, кто стремятся написать в резюме как можно больше разнообразной информации о себе – совершают самую распространенную ошибку. Резюме должно быть максимально конкретным. Не стоит думать, что работодатели оценивают уровень профессионализма кандидата по количеству страниц в его резюме. Это как раз тот случай, когда количество не является качеством.\n\nВ день специалисты по персоналу читают десятки, а то и сотни резюме и если резюме состоит из более чем одной страницы, его, скорее всего, полностью читать не будут или будут читать невнимательно. Вторая страница, как правило, читается редко. На чтение же третей страницы, уже не хватает ни времени, ни желания. Так что есть смысл разместить всю информацию на одной, максимум на двух страницах печатного текста.\n\nПравда, не следует впадать и в другую крайность – излишнюю краткость. Слишком краткое описание своего опыта, умений и навыков не позволит вам показать свои достоинства. Если вам есть чем похвастаться – сделайте это! Скромность тут излишня. Перечислите свои важные достижения в той сфере, в которой вы ищете работу. Обязательно отразите в резюме все, что вы сумели разработать и внедрить в этом направлении на предыдущих местах работы.\n\nТретье правило резюме – целенаправленность. Лучше создать отдельное резюме для каждой отдельной должности. Также старайтесь избегать перечисления в резюме нескольких должностей, даже если они все одинаково вас интересуют. Особенно, если эти должности относятся к разным видам деятельности. Такие резюме плохо воспринимаются работодателями. Одно резюме на все случаи жизни – верный путь к долгому поиску работы!\n\nВ идеале, резюме можно адаптировать даже под каждую конкретную вакансию. Для этого прочитайте описание той вакансии, которая вас интересует, и определите какие ваши умения и навыки помогут вам справиться с этой работой. Также поставьте на первый план те свои достижения, которые имеют значение для рассматриваемой должности. Тогда, читая ваше резюме, работодатель сможет ознакомиться именно с той информацией, которая действительно важна для данной позиции.\n\nИ чем больше будет соответствия между требованиями и информацией в резюме, тем лучше. В этом случае вы сможете вызвать к себе интерес и показать, что являетесь именно тем претендентом, который подходит на эту должность. А обо всех остальных своих навыках и умениях вы сможете рассказать уже непосредственно на собеседовании.\n\nЧетвертое правило составления резюме – позитивность. Если вы хотите, чтобы ваше резюме положительно выделялось из множества других оно должно быть написано позитивным языком. Правильный подбор слов в тексте имеет большое значение. Предлагаем вашему вниманию список тех слов, которые помогут вам произвести на работодателя положительное впечатление: достижение, развитие, опыт, навыки, планирование, эффект, участие, активность, свидетельство, индивидуальный.\n\nНе рекомендуется использовать слова: проблема, ничего, плохо, никогда, всегда, ошибка, провал, ужасно. Использование слов из этой группы не даст положительного эффекта. К примеру, такие слишком категоричные слова как «никогда» или «всегда» – могут навеять мысль о возможной склонности соискателя к преувеличению. Скорее всего, такие предположения не создадут положительного отношения у работодателя.\n\nПятое правило – грамотность! Резюме должно быть составлено грамотно, без орфографических, грамматических и пунктуационных ошибок. Можете быть уверенны – наличие ошибок в тексте резюме произведет негативное впечатление на работодателя. Ведь если соискатель не удосужился проверить и исправить свое резюме, то, скорее всего, так же будет происходить и в работе. Закончив свое резюме, обязательно проверьте его и убедитесь, что все даты и телефоны в нем также указаны верно.";
}

@end
